Repository: Gliese-876/Course-Planner
Catalog: CoursePlanner.Application/Resources/*/Resources.resw
Source language: en_us
Languages: zh_hans

# AppTitle
source: Course Planner
zh_hans: 选课助手

# AppDescription
source: Plan courses, compare schedules, and organize registration priorities
zh_hans: 规划课程、比较课表并整理抢课顺序

source: Planner
zh_hans: 规划

source: Settings
zh_hans: 设置

source: Course Library
zh_hans: 课程库

source: Plans
zh_hans: 方案

# Search
source: Search courses
zh_hans: 搜索课程

source: All semesters
zh_hans: 全部学期

source: Current semester
zh_hans: 当前学期

# PlanCreditsIncludeConflicts
source: includes {0} conflict slot(s)
zh_hans: 含 {0} 个冲突时段

source: Course status in current plan
zh_hans: 当前方案中的课程状态

# CourseLocked
source: Locked
zh_hans: 已锁定

# CourseNotThisWeek
source: Not scheduled this week
zh_hans: 非本周课程

# CourseNotThisWeekTitlePrefix
source: Not this week
zh_hans: 非本周

source: New Course
zh_hans: 新课程

source: New Plan
zh_hans: 新方案

source: New Semester
zh_hans: 新学期

# DefaultSemesterName
source: 2026 Fall
zh_hans: 2026-2027 学年第一学期

# DefaultPlanName
source: Plan 1
zh_hans: 方案 1

source: Copied Plan
zh_hans: 复制方案

# CopiedPlanNameFormat
source: {0} Copy
zh_hans: {0} 副本

source: Open Plan
zh_hans: 打开方案

source: Registration order
zh_hans: 抢课顺序

# RegistrationOrderDialogTitleFormat
source: {0} · Registration order
zh_hans: {0} · 抢课顺序

# RegistrationOrderDescription
source: Drag courses into the order you will try them, or start with an explainable smart recommendation. Saving changes only registration priority, not the timetable layout.
zh_hans: 拖动课程调整尝试顺序，或让智能排序先给出可解释的建议。保存只会改变抢课优先级，不会改变课表布局。

source: Smart sort
zh_hans: 智能排序

source: Pin window
zh_hans: 置顶窗口

source: Unpin window
zh_hans: 取消置顶

source: Reset window size
zh_hans: 重置窗口尺寸

source: Minimize window
zh_hans: 最小化窗口

source: Close window
zh_hans: 关闭窗口

# BackgroundOperation
source: the current operation
zh_hans: 当前操作

# CloseBlockedByBackgroundOperationTitle
source: Operation in progress
zh_hans: 操作正在进行

# CloseBlockedByBackgroundOperationMessageFormat
source: Course Planner cannot close while {0} is in progress. Wait for it to finish, then try again.
zh_hans: “{0}”进行期间无法关闭选课助手。请等待操作完成后重试。

# RuntimeOperationErrorTitle
source: Operation failed
zh_hans: 操作失败

# RuntimeOperationErrorMessage
source: The operation could not be completed, and your latest changes might not have been saved. Check storage access and available disk space, then try again.
zh_hans: 操作未能完成，刚才的更改可能尚未保存。请检查存储访问权限和可用磁盘空间，然后重试。

# RegistrationSmartSortHint
source: Optimize order using enrollment, course type, and study type
zh_hans: 根据名额、课程类型与修读类型自动优化顺序

# RegistrationOrderListHelp
source: Drag courses to reorder, or press Alt+Up/Down. Changes save automatically.
zh_hans: 拖动课程排序；按 Alt+↑/↓ 微调。更改会自动保存。

# RegistrationPriorityRiskCompactFormat
source: risk {0}
zh_hans: 风险 {0}

# RegistrationPriorityUnavailableCompact
source: full
zh_hans: 无余位

# RegistrationPriorityUnknownCompact
source: unknown
zh_hans: 待判断

# ResetOrder
source: Restore opened order
zh_hans: 恢复打开时顺序

# AlgorithmHelp
source: How ranking works
zh_hans: 排序依据

# RegistrationAlgorithmTitle
source: How smart sort works
zh_hans: 智能排序如何工作

# RegistrationAlgorithmDescription
source: The model uses a one-sided 90% Wilson upper bound to correct small-sample occupancy pressure, then estimates the risk that every remaining seat disappears during one action delay. Study type (core, required, elective), course type (major, general, free), credits, and viable alternative sections determine the cost of failure. Custom labels are recognized through common Chinese and English expressions; unrecognized labels use neutral weights, and missing data preserves manual order.
zh_hans: 算法先用单侧 90% Wilson 上置信界修正小样本的占用压力，再估计剩余名额在一次操作延迟内全部消失的风险；随后按修读类型（核心、必修、选修）、课程类型（专业、通识、自由）、学分和可用平行班计算失败代价。自定义标签会通过常见中英文表述识别，无法可靠判断时按中性权重处理；数据不足时保留手动顺序。

# RegistrationOrderEmptyTitle
source: No courses in this plan
zh_hans: 当前方案没有课程

# RegistrationOrderEmptyMessage
source: Add courses to the plan before setting a registration order.
zh_hans: 先向方案添加课程，再设置抢课顺序。

# RegistrationOrderSmartSorted
source: Sorted by expected seat-loss cost. You can still drag to fine-tune it.
zh_hans: 已按预期失位损失重新排序；仍可拖动微调。

# RegistrationCapacityFormat
source: {0}/{1} enrolled · {2} remaining
zh_hans: {0}/{1} 已选 · 剩余 {2}

# RegistrationCapacityUnknown
source: Enrollment or capacity data is missing
zh_hans: 人数或容量数据不足

# RegistrationCapacityUnavailableFormat
source: {0}/{1} enrolled · no seats available
zh_hans: {0}/{1} 已选 · 当前无余位

# RegistrationPriorityRiskFormat
source: Delay seat-loss risk {0}
zh_hans: 延迟失位风险 {0}

# RegistrationPriorityRequiredReason
source: Course-type and study-type failure costs included
zh_hans: 课程类型与修读类型的失败代价已加权

# RegistrationPriorityAlternativeReasonFormat
source: {0:0.#} effective alternative section(s) reduce the loss
zh_hans: {0:0.#} 个有效平行班可缓冲失败

# RegistrationPriorityModelReason
source: Wilson small-sample correction
zh_hans: Wilson 小样本修正

# RegistrationPriorityUnavailableReason
source: No current chance of success, so smart sort places it later
zh_hans: 当前成功率为零，智能排序会将其置后

# RegistrationPriorityUnknownReason
source: Not enough data; smart sort preserves the manual order
zh_hans: 数据不足，智能排序保留手动顺序

# RegistrationPriorityMissingReference
source: Missing course reference
zh_hans: 课程引用缺失

source: Save order
zh_hans: 保存顺序

source: Registration order saved.
zh_hans: 抢课顺序已保存。

source: No open plans
zh_hans: 没有打开的方案

source: No semesters
zh_hans: 还没有学期

# NoCoursesInLibrary
source: No courses in the library
zh_hans: 课程库中没有课程

source: No matching courses
zh_hans: 没有匹配的课程

source: No plan selected
zh_hans: 未选择方案

source: No course selected
zh_hans: 未选择课程

source: Import
zh_hans: 导入

source: Export
zh_hans: 导出

source: More
zh_hans: 更多

source: Backup
zh_hans: 备份

source: Restore
zh_hans: 恢复

source: Refresh Plan
zh_hans: 刷新本方案

source: Refresh All
zh_hans: 刷新全部方案

source: Undo
zh_hans: 撤销

source: Redo
zh_hans: 重做

source: Week
zh_hans: 周课表

# SemesterOverview
source: Semester
zh_hans: 学期概览

source: Compare
zh_hans: 比较

# DifferenceAdded
source: Added
zh_hans: 新增

# DifferenceRemoved
source: Removed
zh_hans: 移除

# DifferenceModified
source: Modified
zh_hans: 变更

source: Previous week
zh_hans: 上一周

source: Next week
zh_hans: 下一周

source: Swap comparison direction
zh_hans: 交换比较方向

source: Close course library
zh_hans: 关闭课程库

source: Close details
zh_hans: 关闭详情

source: Close plan tab
zh_hans: 关闭方案标签

source: Details
zh_hans: 详情

source: Lock course
zh_hans: 锁定课程

source: Unlock course
zh_hans: 解锁课程

# CourseLockedStatusFormat
source: Locked “{0}” and hid it from registration order.
zh_hans: 已锁定“{0}”，并从抢课顺序中隐藏。

# CourseUnlockedStatusFormat
source: Unlocked “{0}” and restored it to registration order.
zh_hans: 已解锁“{0}”，并恢复到抢课顺序。

source: Save
zh_hans: 保存

source: Discard
zh_hans: 放弃

source: Cancel
zh_hans: 取消

source: Retry
zh_hans: 重试

source: OK
zh_hans: 确定

source: Delete
zh_hans: 删除

source: Edit
zh_hans: 编辑

source: Rename
zh_hans: 重命名

source: Copy
zh_hans: 复制

# ClearPlan
source: Clear Current Plan
zh_hans: 清空当前方案

source: Name
zh_hans: 名称

source: Teacher
zh_hans: 教师

source: Location
zh_hans: 地点

source: Credits
zh_hans: 学分

# CreditsShort
source: cr
zh_hans: 学分

source: courses
zh_hans: 门课程

source: Capacity
zh_hans: 容量

source: Enrolled
zh_hans: 已选

# GroupType
source: Course type
zh_hans: 课程类型

source: Study type
zh_hans: 修读类型

# Labels
source: Ordinary labels
zh_hans: 普通标签

# Meetings
source: Meeting times
zh_hans: 上课时间

# MeetingItemTitleFormat
source: Meeting {0}
zh_hans: 上课时间 {0}

# MeetingWeekday
source: Weekday
zh_hans: 星期

# MeetingPeriods
source: Periods
zh_hans: 节次

# MeetingStartPeriod
source: Start period
zh_hans: 开始节次

# MeetingEndPeriod
source: End period
zh_hans: 结束节次

# MeetingWeeks
source: Weeks
zh_hans: 周次

# MeetingParity
source: Parity
zh_hans: 单双周

# MeetingParityAll
source: Every week
zh_hans: 每周

# MeetingParityOdd
source: Odd weeks
zh_hans: 单周

# MeetingParityEven
source: Even weeks
zh_hans: 双周

# AddMeetingTime
source: Add time
zh_hans: 添加时间

# RemoveMeetingTime
source: Remove time
zh_hans: 删除时间

source: Notes
zh_hans: 备注

source: Course color
zh_hans: 课程色

# RecommendedColor
source: Recommended
zh_hans: 推荐色

# CourseColorBrightnessWarning
source: This color is outside the recommended generated-color brightness/background-distance range. It can be saved, but may be less clear in light or dark mode.
zh_hans: 该颜色超出自动生成色的推荐亮度与背景距离范围；可以保存，但可能在浅色或深色模式下不够清晰。

source: Advanced filters
zh_hans: 高级筛选

source: Filters
zh_hans: 筛选

# LabelFilter
source: Labels (OR, comma separated)
zh_hans: 普通标签（同字段 OR，逗号分隔）

# GroupFilter
source: Course types (OR)
zh_hans: 课程类型（OR）

# StudyFilter
source: Study types (OR)
zh_hans: 修读类型（OR）

# TeacherFilter
source: Teachers (OR)
zh_hans: 教师（OR）

# LocationFilter
source: Locations (OR)
zh_hans: 地点（OR）

source: Language
zh_hans: 语言

source: Theme
zh_hans: 主题

source: General
zh_hans: 常规

source: Search settings
zh_hans: 搜索设置

# LanguageDescription
source: App display language
zh_hans: 应用显示语言

# ThemeDescription
source: Color mode and system theme behavior
zh_hans: 颜色模式和系统主题行为

source: Follow system
zh_hans: 跟随系统

# Chinese
source: Simplified Chinese
zh_hans: 简体中文

source: Light
zh_hans: 浅色

source: Dark
zh_hans: 深色

source: Semester management
zh_hans: 学期管理

source: Semesters
zh_hans: 学期

# SemestersDescription
source: Choose the semester to edit
zh_hans: 选择要编辑的学期

source: Start date
zh_hans: 开始日期

source: End date
zh_hans: 结束日期

source: Year
zh_hans: 年份

source: Month
zh_hans: 月份

source: Previous month
zh_hans: 上个月

source: Next month
zh_hans: 下个月

source: Today
zh_hans: 今天

source: Hour
zh_hans: 小时

source: Minute
zh_hans: 分钟

source: Weeks
zh_hans: 周数

source: Week starts
zh_hans: 周起始日

# WeekStartMonday
source: Monday
zh_hans: 周一

# WeekStartSunday
source: Sunday
zh_hans: 周日

source: Period schedule
zh_hans: 节次时间表

# PeriodScheduleDescription
source: Add or delete daily periods and edit each time range
zh_hans: 添加、删除每日节次并编辑每节起止时间

source: Period
zh_hans: 节次

source: Start
zh_hans: 开始

source: End
zh_hans: 结束

source: Data management
zh_hans: 数据管理

source: Database location
zh_hans: 数据库位置

# DatabaseLocationDescription
source: Open the local data folder in File Explorer
zh_hans: 用文件资源管理器打开本地数据文件夹

source: Open database folder
zh_hans: 打开数据库文件夹

# BackupAndExchange
source: Backup and restore
zh_hans: 备份与恢复

# BackupAndExchangeDescription
source: Create or restore a backup containing all course planner data
zh_hans: 创建或恢复包含全部选课数据的备份

# SoftwareInformation
source: App information
zh_hans: 软件信息

# AppVersionFormat
source: Version {0}
zh_hans: 版本 {0}

source: Publisher
zh_hans: 发布者

source: Open GitHub profile
zh_hans: 打开 GitHub 主页

# OpenSourceLicense
source: MIT License
zh_hans: MIT 许可证

# OpenSourceLicenseDescriptionFormat
source: {0} is open source under the MIT License
zh_hans: {0} 采用 MIT 许可证开源

source: View MIT License
zh_hans: 查看 MIT 许可证

# MitLicenseTitle
source: MIT License
zh_hans: MIT 许可证

source: Third-party licenses
zh_hans: 第三方许可证

# LicensesDescription
source: Review third-party component licenses used by the app
zh_hans: 查看应用使用的第三方组件许可证

source: View licenses
zh_hans: 查看许可证

# LicenseNoticeIntro
source: This app uses the following third-party components. The corresponding project repositories or NuGet packages contain the complete license text.
zh_hans: 本应用使用以下第三方组件。完整许可证以对应项目仓库或 NuGet 包为准。

source: Add
zh_hans: 添加

source: Save period
zh_hans: 保存节次

source: Add period
zh_hans: 添加节次

source: Delete period
zh_hans: 删除节次

source: Reset default
zh_hans: 重置默认

source: Clear Current Semester Courses
zh_hans: 清空当前学期课程

source: Cannot save semester
zh_hans: 无法保存学期

source: Delete semester
zh_hans: 删除学期

# DeleteSemesterConfirm
source: This will create an automatic backup, then delete the semester, its library courses and plans. Continue?
zh_hans: 将创建自动备份，然后删除该学期、其课程库课程和方案。继续？

source: Clear courses
zh_hans: 清空课程

# ClearCoursesConfirm
source: Clear all library courses in the selected semester? Plans using those courses will remove the corresponding course references.
zh_hans: 清空所选学期的所有课程库课程？使用这些课程的方案会同步移除对应课程引用。

source: Invalid period
zh_hans: 节次无效

# EndTimeAfterStart
source: End time must be after start time.
zh_hans: 结束时间必须晚于开始时间。

# PeriodScheduleCannotExtend
source: The period cannot be added because the resulting schedule would cross midnight.
zh_hans: 无法添加该节次，否则生成的时间表会跨越午夜。

# DeletePeriodConfirm
source: Delete period {0}? Courses using this period may become out of range.
zh_hans: 删除第 {0} 节？使用该节次的课程可能变为超出范围。

source: Reset periods
zh_hans: 重置节次

# ResetPeriodsConfirm
source: Reset this semester to the default 12-period schedule? Course meetings after period 12 will be removed, and meetings crossing period 12 will be shortened.
zh_hans: 将该学期重置为默认 12 节时间表？第 12 节之后的上课安排将被移除，跨越第 12 节的安排将被截短。

# LabelManagement
source: Labels
zh_hans: 标签

# LabelManagementDescription
source: Manage course type, study type, and ordinary labels
zh_hans: 管理课程类型、修读类型和普通标签

source: Label name
zh_hans: 标签名称

source: Label kind
zh_hans: 标签类型

# LabelKindOrdinary
source: Ordinary
zh_hans: 普通标签

# LabelKindCourseGroup
source: Course type
zh_hans: 课程类型

# LabelKindStudy
source: Study type
zh_hans: 修读类型

source: Move up
zh_hans: 上移

source: Move down
zh_hans: 下移

source: New label
zh_hans: 新标签

source: Save label
zh_hans: 保存标签

source: Delete label
zh_hans: 删除标签

source: Cannot save label
zh_hans: 无法保存标签

# DeleteLabelConfirm
source: Delete label {0}? Course assignments using it will be cleared.
zh_hans: 删除标签 {0}？使用它的课程关联会被清除。

source: Backup created
zh_hans: 备份已创建

source: Backup failed
zh_hans: 备份失败

# DeleteSemesterBackupFailed
source: The semester was not deleted because its safety backup could not be created. Check storage access and available disk space, then try again.
zh_hans: 无法创建安全备份，因此未删除学期。请检查存储访问权限和可用磁盘空间后重试。

source: Restore backup
zh_hans: 恢复备份

# RestoreConfirm
source: Restore overwrites current data after creating an automatic pre-restore backup. Continue?
zh_hans: 恢复会在创建自动恢复前备份后覆盖当前数据。继续？

source: Restore complete
zh_hans: 恢复完成

source: Restore failed
zh_hans: 恢复失败

# RestoreCommittedRefreshRequired
source: Restore completed; app refresh required
zh_hans: 恢复已完成；应用需要刷新

# RestoreCommittedRefreshMessage
source: The restored data was committed, but part of the application did not refresh. Reload the committed data now.
zh_hans: 恢复的数据已经提交，但应用的部分状态未能刷新。请立即重新加载已提交的数据。

# RestoreCommittedRefreshRecoveryCompleteMessage
source: The restored data was already committed and the application state has now been reloaded successfully.
zh_hans: 恢复的数据此前已成功提交，应用状态现已重新加载。

# RestoreCleanupWarningFormat
source: The restored data was committed, but temporary recovery files could not be removed. You can remove them later from: {0}
zh_hans: 恢复的数据已经提交，但无法删除临时恢复文件。稍后可从此位置手动删除：{0}

source: Restore recovery complete
zh_hans: 恢复状态已安全处理

# RestoreRecoveryCompleteMessage
source: The interrupted restore was safely terminated and the document was reloaded. You can try restoring the backup again.
zh_hans: 中断的恢复事务已安全终结，文档也已重新加载。现在可以再次尝试恢复备份。

source: Pre-restore backup
zh_hans: 恢复前备份

source: Unsaved changes
zh_hans: 有未保存更改

source: Conflict
zh_hans: 时间冲突

source: Full
zh_hans: 满员

source: Tight
zh_hans: 紧张

source: Compare selected
zh_hans: 比较所选方案

source: Base course
zh_hans: 基准课程

source: Restore to Base
zh_hans: 恢复为基准方案

source: Remove from Current
zh_hans: 从当前方案移除

source: Add from Base
zh_hans: 从基准方案添加

source: Cannot rename plan
zh_hans: 无法重命名方案

# PlanNameUnique
source: Plan names must be unique within the same semester.
zh_hans: 同一学期内方案名必须唯一。

# ClearPlanConfirm
source: Clear {0}?
zh_hans: 清空方案 {0}？

# DeletePlanConfirm
source: Delete {0}?
zh_hans: 删除方案 {0}？

source: Discard unsaved changes?
zh_hans: 放弃未保存更改？

source: Don't save
zh_hans: 不保存

# DeleteFromLibraryConfirm
source: Delete {0} from library?
zh_hans: 从课程库删除 {0}？

# DeleteFromLibraryImpact
source: This will remove the course from {0} plan(s): {1}.
zh_hans: 这会从 {0} 个方案中移除该课程：{1}。

# RemoveFromCurrentPlanConfirm
source: Remove {0} from current plan?
zh_hans: 从当前方案移除 {0}？

source: Copy to current semester
zh_hans: 复制到当前学期

source: Copy and add
zh_hans: 复制并加入

source: Duplicate course
zh_hans: 重复课程

# AlreadyInCurrentPlan
source: {0} is already in the current plan.
zh_hans: {0} 已在当前方案中。

source: Replace existing
zh_hans: 替换已有课程

source: Skip
zh_hans: 跳过

source: Keep conflict
zh_hans: 保留冲突

source: Remove conflicts then add
zh_hans: 移除冲突课程后加入

# ConflictsWith
source: Conflicts with: {0}
zh_hans: 冲突课程：{0}

# AddedCourse
source: Added {0}.
zh_hans: 已加入 {0}。

source: Open
zh_hans: 打开

# OpenFileFailed
source: Couldn't open this file with the system default app.
zh_hans: 无法使用系统默认应用打开该文件。

source: Apply
zh_hans: 应用

source: Add All to Course Library
zh_hans: 全部添加到课程库

source: Status
zh_hans: 状态

source: All statuses
zh_hans: 全部状态

source: Semester filter
zh_hans: 学期筛选

source: Search visible fields
zh_hans: 搜索可见字段

source: Force semester merge conflicts
zh_hans: 强制合并学期冲突

source: Update local semester settings
zh_hans: 更新本地学期设置

source: Force import out-of-range courses
zh_hans: 强制导入超范围课程

# ImportDecisionWarning
source: Updating local semester settings changes how every course and plan in that semester is displayed. Forced merge imports into the existing local semester name. Out-of-range courses are skipped unless explicitly forced.
zh_hans: 更新本地学期设置会改变该学期所有课程和方案的显示方式。强制合并会导入到现有本地学期名下。超范围课程默认跳过，必须显式强制才会导入。

source: Save report
zh_hans: 保存报告

source: Imported Plan
zh_hans: 导入方案

source: Next
zh_hans: 下一步

source: Back
zh_hans: 返回

source: Cancel import
zh_hans: 取消导入

# ImportCheckingFile
source: Checking import file…
zh_hans: 正在检查导入文件…

source: Import completed.
zh_hans: 已完成导入。

# ImportNotApplied
source: Nothing was imported. Resolve the conflicts or required decisions in the preview, then try again.
zh_hans: 未导入任何内容。请先解决预览中的冲突或必选操作，然后重试。

source: Import failed
zh_hans: 导入失败

source: Import preview
zh_hans: 导入预览

# ImportChangesTitle
source: Review the changes
zh_hans: 请检查将要进行的更改

# ImportCourseSyncPreviewWarning
source: This plan contains courses that are not yet in the course library. The courses must be synchronized before the plan can be imported.
zh_hans: 此方案包含课程库中尚不存在的课程。只有将这些课程同步到课程库，才能导入方案。

# ImportMissingCourses
source: Courses missing from the library
zh_hans: 课程库中缺少的课程

# ImportCourseSyncTitleFormat
source: Import {0} course(s) into the library too?
zh_hans: 同时将 {0} 门课程导入课程库？

# ImportCourseSyncRequired
source: The current plan references the following {0} course(s), which are not in the course library. These courses must be synchronized before the plan can be imported.
zh_hans: 当前方案引用的以下 {0} 门课程不在课程库中。只有先同步这些课程，才能导入当前方案。

# ImportSyncAndApply
source: Sync courses and import plan
zh_hans: 同步课程并导入方案

# ExportChooseContent
source: First, choose what you want to export.
zh_hans: 请先选择要导出的内容。

# ExportContentType
source: Export content
zh_hans: 导出内容

source: Export settings
zh_hans: 导出设置

# ExportContentCurrentWeek
source: Current week
zh_hans: 当前周

# ExportContentWeekRange
source: Week range
zh_hans: 周范围

# ExportContentDetailedSemester
source: Entire semester
zh_hans: 整个学期

# ExportContentCurrentPlan
source: Current plan data (JSON)
zh_hans: 当前方案数据（JSON）

# ExportContentCourseLibrary
source: Course library data (JSON)
zh_hans: 课程库数据（JSON）

# ExportContentShareText
source: Share text
zh_hans: 分享文本

# ExportContentUnavailable
source: Select a semester and open a plan to use this option.
zh_hans: 请先选择学期并打开方案。

source: Export format
zh_hans: 导出格式

# ExportFormatPng
source: PNG image
zh_hans: PNG 图片

# ExportFormatPdf
source: Vector PDF
zh_hans: 矢量 PDF

source: Export theme
zh_hans: 导出主题

# ExportThemeFollowSystemFormat
source: Follow system (currently {0})
zh_hans: 跟随系统（当前为 {0}）

# ExportClarity
source: Image clarity
zh_hans: 图片清晰度

# ExportClarityStandard
source: Standard
zh_hans: 标清

# ExportClarityHigh
source: High (recommended)
zh_hans: 高清（推荐）

# ExportClarityUltra
source: Ultra
zh_hans: 超清

# ExportClarityExtreme
source: Extreme
zh_hans: 极清

# ExportClarityMaximum
source: Maximum
zh_hans: 最高

# ExportCourseBlockContent
source: Course block content
zh_hans: 课程块显示内容

# ExportFieldCourseName
source: Course name
zh_hans: 课程名称

# ExportCourseNameRequired
source: The course name is always included in exported course blocks.
zh_hans: 课程名称始终包含在导出内容中。

# ExportSummaryVisualFormat
source: {0} · {1} · {2} · {3} course fields selected
zh_hans: {0} · {1} · {2} · 已选 {3} 项课程信息

# ExportRequiresSemester
source: Select a semester first.
zh_hans: 请先选择学期。

# ExportRequiresPlan
source: Open a plan first.
zh_hans: 请先打开方案。

# ShareTextCopied
source: Share text copied to the clipboard.
zh_hans: 分享文本已复制到剪贴板。

# CannotExportInvalidName
source: Cannot export: invalid {0} name
zh_hans: 无法导出：{0} 名称无效

source: Readable text
zh_hans: 可读文本

source: Format
zh_hans: 格式

source: Include notes
zh_hans: 包含备注

source: Start week
zh_hans: 开始周

source: End week
zh_hans: 结束周

# ExportedWeeklyPngFiles
source: Exported weekly PNG files to {0}.
zh_hans: 已导出周 PNG 文件到 {0}。

# SavedFile
source: Saved {0}
zh_hans: 已保存 {0}

source: Report format
zh_hans: 报告格式

source: Save import report
zh_hans: 保存导入报告

# ExportPathTooLong
source: Export path is too long
zh_hans: 导出路径过长

source: Export failed
zh_hans: 导出失败

# ChooseShorterPath
source: Choose a shorter file name or directory, then export again.
zh_hans: 请选择更短的文件名或目录后重新导出。

# ChooseAnotherPath
source: Choose another location or file name, then export again.
zh_hans: 请选择其他位置或文件名后重新导出。

# SaveCourseEditBeforeChangingDetails
source: The current course changes have not been saved. Save them first?
zh_hans: 当前课程更改尚未保存。是否先保存？

source: Validation failed
zh_hans: 校验失败

# AddMenu
source: Add
zh_hans: 添加

source: Current plan
zh_hans: 当前方案

source: All open plans
zh_hans: 所有打开方案

source: Other plans...
zh_hans: 其他方案……

source: Delete from library
zh_hans: 从课程库删除

source: Search plans
zh_hans: 搜索方案

source: Select target plans
zh_hans: 选择目标方案

# AddedToPlans
source: Added to {0}/{1} plan(s)
zh_hans: 已加入 {0}/{1} 个方案

# ReplacedDuplicates
source: replaced {0} duplicate(s)
zh_hans: 替换 {0} 个重复项

# SkippedCount
source: skipped {0}
zh_hans: 跳过 {0} 个

# CancelledConflicted
source: cancelled {0} conflicted plan(s)
zh_hans: 取消 {0} 个冲突方案

# RemovedConflicting
source: removed {0} conflicting course(s)
zh_hans: 移除 {0} 个冲突课程

source: Bulk add course
zh_hans: 批量添加课程

source: Apply duplicate handling to all
zh_hans: 将重复处理应用到全部

source: Per plan
zh_hans: 逐方案处理

# SkipExistingAll
source: Skip existing in all target plans
zh_hans: 全部跳过已有课程

# ReplaceExistingAll
source: Replace existing in all target plans
zh_hans: 全部替换已有课程

source: Apply conflict handling to all
zh_hans: 将冲突处理应用到全部

# CancelConflictedPlans
source: Cancel conflicted target plans
zh_hans: 取消冲突目标方案

source: Add and keep conflicts
zh_hans: 加入并保留冲突

# CopyTo
source: copy to {0}
zh_hans: 复制到 {0}

source: duplicate
zh_hans: 重复

# Conflicts
source: conflicts: {0}
zh_hans: 冲突：{0}

source: Skip existing
zh_hans: 跳过已有课程

source: Replace existing course
zh_hans: 替换已有课程

source: Cancel add for this plan
zh_hans: 取消加入此方案

source: Apply to all
zh_hans: 应用到全部

# AddToCurrentPlanCaption
source: Add to current plan
zh_hans: 加入当前方案

# EnterValidHexColorFirst
source: Enter a valid #RRGGBB color first.
zh_hans: 请先输入有效的 #RRGGBB 颜色。

source: Out of range
zh_hans: 超出范围

source: Save anyway?
zh_hans: 仍然保存？

source: Saved.
zh_hans: 已保存。

source: Course identity will change
zh_hans: 课程身份将改变

# CourseIdentityChangeText
source: Changing the course name, teacher, location, semester, or meeting times creates a new course identity. After saving, every plan using this course will reference the new course identity automatically.
zh_hans: 修改课程名、教师、地点、学期或上课时间会生成新的课程身份。保存后，所有使用该课程的方案会自动改为引用新的课程身份。

# WeekSelectorPrefix
source: Week
zh_hans: 第

# SemesterOverviewTitleFormat
source: {0} / {1} / Weeks 1-{2} {3} - {4}
zh_hans: {0} / {1} / 第 1-{2} 周 {3} - {4}
